Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའི་སེམས་འདོད་ཆགས་དང་བཅས་པ། ཞེ་སྡང་དང་བཅས་པ། གཏི་མུག་དང་བཅས་པ་ཡིན་ནམ།
en: The Blessed One asked, “Śāradvatīputra, tell me, is the mind of a bodhisattva involved in attachment, anger, and delusion?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་འདོད་ཆགས་དང་བཅས་པ། ཞེ་སྡང་དང་བཅས་པ། གཏི་མུག་དང་བཅས་པ་ལགས་སོ།
en: Śāradvatīputra replied, “Yes, Blessed One, it is involved in attachment, anger, and delusion.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དགྲ་བཅོམ་པའི་སེམས་འདོད་ཆགས་དང་བྲལ་བ། ཞེ་སྡང་དང་བྲལ་བ། གཏི་མུག་དང་བྲལ་བ་ཡིན་ནམ།
en: The Blessed One said, “Śāradvatīputra, tell me, is the mind of a worthy one free of attachment, anger, and delusion?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་ཏེ།
en: Śāradvatīputra replied, “Yes, Blessed One, it is.

source: དགྲ་བཅོམ་པའི་སེམས་འདོད་ཆགས་དང་བྲལ་བ། ཞེ་སྡང་དང་བྲལ་བ། གཏི་མུག་དང་བྲལ་བ་ལགས་སོ།
en: The mind of a worthy one is free of attachment, anger, and delusion.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གལ་ཏེ་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ལ་བྱམས་པ་དང་། སྙིང་རྗེས་ཁྱབ་པར་བྱས་ཀྱང་། དེའི་ཚེ་སེམས་ཅན་དེ་དག་བདེ་བས་ཚིམ་པར་འགྱུར་རམ།
en: The Blessed One said, “Śāradvatīputra, tell me, if a worthy one who has exhausted defilements were to embrace all limitless beings with love and compassion, would they all become filled with happiness at that point?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་དགྲ་བཅོམ་པ་ནི་ཐབས་ལ་མཁས་པ་མ་མཆིས་ན། སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་པ་རྣམས་ལ་བྱམས་པས་ཇི་ལྟར་ཁྱབ་པར་བགྱི།
en: Śāradvatīputra said, “Blessed One, since the worthy ones are not skillful, how would they be able to embrace all limitless beings with love?

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་ཇི་སྲིད་དུ་མཉམ་པར་གཞག་པ་དེ་སྲིད་ཀྱི་བར་དེར་བྱམས་པ་དེས་ཁ་ཅིག་ནི་བདེ་བར་འགྱུར། ཁ་ཅིག་ནི་སྡུག་བསྔལ་བར་འགྱུར་ལགས་སོ།
en: Blessed One, as long as they rest in equipoise, their love might secure the happiness of some beings but others would continue to suffer.

source: །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐོབ་པ་དེའི་ཚེ་སེམས་ཀྱི་སྐད་ཅིག་ལ། བྱམས་པ་ལ་གནས་ཤིང་བྱམས་པ་མངོན་པར་སྒྲུབ་པ་མ་ལགས་མོད་ཀྱི།
en: Blessed One, when bodhisattvas attain the state of omniscience, they neither accomplish, nor practice, love for a single instant in their mind.

source: བཅོམ་ལྡན་འདས་གནས་མ་མཆིས་པ་ནན་གྱིས་དཔེར་བགྱིས་ཏེ་བཤད་པར་བགྱི་ན།
en: Blessed One, let me try to give an analogy for this non-abiding.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་འཛམ་བུའི་གླིང་འདིར་བདག་དང་འདྲ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ་ཤ་སྟག་གིས་གང་བར་གྱུར་ལ།
en: Imagine, Blessed One, that this entire world was filled entirely with beings who, like me, were absorbed in the eight liberations.

source: དེ་དག་ཀྱང་བྱམས་པ་ལ་སྙོམས་པར་ཞུགས་སམ། གལ་ཏེ་སྙོམས་པར་འཇུག་པར་འཚལ་ན་ཡང་སྙོམས་པར་འཇུག་པའི་འོས་མ་ལགས་སོ།
en: Even if all of them practiced the attainment of love, or even just attempted such an attainment, they would still not be fit for such an attainment.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་འདིས་ཀྱང་ཟག་པ་མེད་པའི་སེམས་ལས་བྱང་ཆུབ་སེམས་དཔའི་སེམས་མཆོག་ཅེས་བྱ་བ་ནས། གོང་ན་མེད་པ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One said, “Śāradvatīputra, in this way, compared to an undefiled mind, the mind of a bodhisattva is supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་དགྲ་བཅོམ་པ་མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པ་ཤ་སྟག་ཏུ་གྱུར་ལ། དགྲ་བཅོམ་པ་རེ་རེས་ཀྱང་བདུད་ཀྱི་སྡེ་འཁྲུགས་མེད་འཁྲུགས་མེད་སྙེད་མངོན་པར་སྤྲུལ་ན།
en: Moreover, Śāradvatīputra, suppose all beings became worthy ones in possession of the six superknowledges and each of them could conjure displays of demonic hordes numbering into the trillions.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འཁྲུགས་མེད་དེ་དག་མང་བ་ཡིན་ནམ།
en: Śāradvatīputra, tell me, would those trillions of demons not be numerous?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ།
en: Śāradvatīputra said, “Blessed One, yes, they would be numerous.

source: །བདེ་བར་གཤེགས་པ་མང་ལགས་སོ།
en: Well-Gone One, they would be numerous.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དགྲ་བཅོམ་པ་དེ་དག་དང་། དཔུང་དེ་དག་གིས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་སེམས་དེ་བཟློག་པར་ནུས་སམ།
en: The Blessed One said, “Śāradvatīputra, tell me, would those worthy ones and those armies be able to resist a bodhisattva’s mind of awakening?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་དེ་གཉིས་ཀྱི་ནང་ན་གང་མཐུ་ཆེ།
en: The Blessed One said, “Śāradvatīputra, tell me, between these two, which would be more powerful?

source: སེམས་ཅན་ཐམས་ཅད་ཟག་པ་ཟད་པར་གྱུར་པ་རྣམས་ཀྱི་ཟག་པ་མེད་པའི་སེམས་གང་ཡིན་པ་མཐུ་ཆེའམ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་མཐུ་ཆེ།
en: If all beings exhausted their defilements, would their undefiled minds be more powerful, or would the mind of a nonregressing bodhisattva be of greater power?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཆེས་མཐུ་ཆེ་ལགས་སོ།
en: Śāradvatīputra said, “Blessed One, the mind of a bodhisattva would be much more powerful.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་སེམས་ཆེས་མཐུ་ཆེ་བ་ཡིན་ཏེ།
en: The Blessed One said, “Yes, the mind of awakening of a nonregressing bodhisattva would be more powerful.

source: ཤ་ར་དྭ་ཏིའི་བུ་ཟག་པ་མེད་པའི་སེམས་ཀྱིས་བདུད་ཀྱི་སྡེ་འཁྲུགས་མེད་དཔག་ཏུ་མེད་པ་རྫུ་འཕྲུལ་གྱིས་མངོན་པར་སྤྲུལ་ན་ཡང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཀྱིས། འདོད་ཆགས་དང་བཅས་པ། ཞེ་སྡང་དང་བཅས་པ། གཏི་མུག་དང་བཅས་པའི་སེམས་ཡོངས་སུ་གཏུགས་པར་མི་ནུས་སོ།
en: Śāradvatīputra, even though the undefiled mind may be able to perform miracles that display limitless trillions of demonic armies, that mind, which is without attachment, would be unable to measure up to the mind that is involved with attachment, anger, and delusion.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་འདི་དག་གི་ནང་ན་སེམས་གང་མཆོག་ཅེས་བྱ་བ་ནས། གོང་ན་མེད་པ་ཞེས་བྱ་བའི་བར་དུ་གང་ཡིན།
en: Śāradvatīputra, tell me, between these types of mind, which is the one that is supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་མཆོག་ཅེས་བགྱི་བ་ནས། གོང་ན་མ་མཆིས་པ་ཞེས་བགྱི་བའི་བར་དུ་ལགས་སོ།
en: Śāradvatīputra said, “Blessed One, the mind of a nonregressing bodhisattva is supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.

source: འདི་ལྟར་ཟག་པ་མ་མཆིས་པའི་སེམས་ཀྱིས་གཏུགས་པར་བགྱིར་རྔོ་མི་ཐོགས་པའི་སླད་དུའོ།
en: Because the undefiled mind is incapable of measuring up to it.”

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཁྱོད་ཉིད་ལ་ཡོངས་སུ་དྲི་བར་བྱས།
en: The Blessed One said, “Moreover, Śāradvatīputra, let me ask you a question.

source: ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་ལན་ཐོབ་ཤིག །
en: Please reply as best you can.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གལ་ཏེ་མཆིང་བུའི་ནོར་བུ་དག་གི་ནང་དུ། ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་བཞག་ན། ཅི་མཆིང་བུའི་ནོར་བུ་དེ་དག་གིས་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་ལ་གསལ་བ་དང་། རིན་ཐང་གིས་ཐུབ་བམ།
en: Śāradvatīputra, tell me, if one places a beryl gemstone next to several semiprecious stones, can the semiprecious stones compete with the luster and value of the beryl gemstone?”

source: །མཆིང་བུའི་ནོར་བུ་དག་གི་ཕུང་པོ་ཆེན་པོས་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་གཅིག་ཀྱང་ཟིལ་གྱིས་གནོན་པར་རྔོ་མི་ཐོགས་ལགས་སོ།
en: Even a large collection of semiprecious stones would be unable to compete with a single beryl gemstone.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ཅིའི་ཕྱིར།
en: The Blessed One asked, “Why is that?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཆིང་བུའི་ནོར་བུ་དེ་དག་ནི་ཡོངས་སུ་དག་པ་ཡང་མ་ལགས། ཁ་དོག་བཟང་བ་ཡང་མ་ལགས། རིན་ཐང་ཡང་ཆུང་ལ།
en: Śāradvatīputra replied, “Blessed One, because semiprecious stones are not pure, their color is not fine, their value is low, and they are common.

source: བརྗོད་པར་ཡང་ནུས་པ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་མཆིང་བུའི་ནོར་བུ་ནི་གནས་རྒྱ་ཆེན་པོ་ནས་བྱུང་བ་ཡང་མ་ལགས་སོ།
en: Moreover, Blessed One, semiprecious stones are also not extracted from an expansive source.

source: །བཅོམ་ལྡན་འདས་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་ནི་རིགས་ཀྱིས་འཕགས་པ་ལགས་ཏེ།
en: Blessed One, on the other hand, beryl gems are of an especially fine nature.

source: སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་བྱུང་བ་ལགས་ཏེ།
en: They appear from the oceans due to the ripening of beings’ karma.

source: དེ་ནི་མཆིང་བུའི་ནོར་བུ་མང་པོས་ཟིལ་གྱིས་གནོན་པར་རྔོ་མི་ཐོགས་སོ།
en: Even a great number of semiprecious stones would be unable to compare with that.”

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ནི་ཉན་ཐོས་ཐམས་ཅད་ཀྱི་སེམས་ཟིལ་གྱིས་གནོན་པར་འདུག་སྟེ།
en: The mind of a nonregressing bodhisattva great being outshines the minds of all hearers.

source: དེ་བཞིན་གཤེགས་པས་དོན་གྱི་དབང་འདི་ཡང་དག་པར་གཟིགས་ནས། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མཆོག་ཉིད་དུ་བཞག་པ་ནས། གོང་ན་མེད་པ་ཉིད་ཀྱི་བར་དུ་བཞག་པ་ཡིན་ནོ།
en: The Thus-Gone One sees this situation very clearly and therefore states that the mind of a nonregressing bodhisattva great being is supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.

source: །ཉན་ཐོས་དགྲ་བཅོམ་པ་ཐམས་ཅད་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་གང་བྱམས་པ་དང་ལྡན་པ་དང་། སྙིང་རྗེ་དང་ལྡན་པ་ཡང་ཟད་པར་བྱེད་མི་ནུས་སོ།
en: All the hearers and worthy ones together could not extinguish the loving and compassionate mind of a bodhisattva. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པ་དེ་དག་གིས་ཀྱང་། འཇིག་རྟེན་གྱི་ཁམས་འདི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དུ་རྫུ་འཕྲུལ་གྱིས་འཕང་བར་ནུས་མོད་ཀྱི། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ནི་ཟད་པར་བྱེད་མི་ནུས་སོ།
en: Śāradvatīputra, the worthy ones who have exhausted the defilements and possess the six superknowledges may be able to miraculously hurl this world into another realm, but they would be unable to extinguish the mind of a nonregressing bodhisattva. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པ་དེ་དག་གིས་ཀྱང་། རྒྱ་མཚོ་ཆེན་པོ་ཁའི་དབུགས་ཀྱིས་སྐམ་པར་ནུས་མོད་ཀྱི། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ནི་ཟིལ་གྱིས་མནན་པའམ། ཟད་པར་བྱེད་མི་ནུས་སོ།
en: Śāradvatīputra, the worthy ones who have exhausted the defilements and possess the six superknowledges may be able to dry out the oceans with a single gulp, but they would be unable to overpower or extinguish the mind of a nonregressing bodhisattva great being. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པ་དེ་དག་གིས་ཀྱང་། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྲེག་པའི་མེའི་ཕུང་པོ་ཆེན་པོ་དེ་ཡང་ཁའི་དབུགས་ཀྱིས་གསད་པར་ནུས་མོད་ཀྱི། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ནི་ཟིལ་གྱིས་མནན་པའམ། ཟད་པར་བྱེད་མི་ནུས་སོ།
en: Śāradvatīputra, the worthy ones who have exhausted the defilements and possess the six superknowledges may be able to extinguish as many great and blazing fires as there are grains of sand in the Ganges in a single puff, but they would be unable to overpower or extinguish the mind of a nonregressing bodhisattva great being. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་འདིས་ན། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མཆོག་ཅེས་བྱ། གཙོ་བོ་དང་། ཕུལ་དང་། ར་བ་དང་། རབ་མཆོག་དང་། བླ་ན་མེད་པ་ནས་གོང་ན་མེད་པ་ཞེས་བྱ་བའི་བར་དུ་བརྗོད་དོ།
en: Śāradvatīputra, as shown in these analogies, the mind of a nonregressing bodhisattva great being is supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་རྒྱ་ཆེ་ཞིང་ཟད་པར་བགྱི་བའམ། བཟློག་པར་མི་ནུས་པ་ངོ་མཚར་ལགས་སོ།
en: Venerable Śāradvatīputra then said to the Blessed One, “Blessed One, it is amazing how vast the mind of a nonregressing bodhisattva great being is—and also how impossible it is to extinguish or resist that mind.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One said, “Śāradvatīputra, that is true.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གཉིས་སུ་མི་གསུང་སྟེ།
en: The reason it is true, Śāradvatīputra, is that the blessed buddhas do not speak in uncertain terms.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་གཉིས་སུ་མེད་པར་གསུང་ཞིང་། དེ་བཞིན་ཁོ་ན་སྟེ་གཞན་དུ་མ་ཡིན་ནོ།
en: The thus-gone ones speak definitively, conclusively, and with certainty.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སེམས་ཅན་གཞན་དག་བྱུང་བར་གྱུར་ལ། སའི་ཁམས་ཇི་སྙེད་པ་དང་། ཆུའི་ཁམས་ཇི་སྙེད་པ་དང་། མེའི་ཁམས་ཇི་སྙེད་པ་དང་། རླུང་གི་ཁམས་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སེམས་ཅན་གཞན་དག་བྱུང་བར་གྱུར་ན།
en: Śāradvatīputra, imagine that all beings in all the limitless and countless worlds, which are as numerous as the grains of sand in the Ganges, were to appear here, and along with them, as many beings as there are particles of the earth element, the water element, the fire element, and the wind element.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་དེ་དག་མང་བ་ཡིན་ནམ།
en: Now, Śāradvatīputra, tell me, would that not be a lot of beings?”

source: །བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །
en: Well-Gone One, that would be a lot indeed.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་དེ་དག་ཀྱང་མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པར་གྱུར་ཏེ། རེ་རེ་ཞིང་འདི་ལྟར་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལྟ་བུར་རྫུ་འཕྲུལ་དང་ལྡན་པར་གྱུར་ལ། རྫུ་འཕྲུལ་ཅན་དེ་དག་གིས་འདི་ལྟར་སེམས་ཅན་དེ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་བདུད་སྡིག་ཅན་མངོན་པར་སྤྲུལ་ཏེ། སྡིག་ཅན་རེ་རེ་ལ་ཡང་སེམས་ཅན་དེ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་གླང་པོ་ཆེའི་ཚོགས་ཡོད་པ་དང་། རྟའི་ཚོགས་དང་། ཤིང་རྟའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་ཡོད་པར་གྱུར་ཏེ།
en: The Blessed One said, “Śāradvatīputra, imagine then if all those beings mastered the six superknowledges and had miraculous abilities, just like Mahāmaudgalyāyana, and all those beings with miraculous abilities then emanated an amount of evil Māras equal in number to the beings themselves, each demon possessing that same number of elephants, horses, chariots, and infantrymen.

source: བགྲང་བ་འདི་ལྟ་བུའི་ཚུལ་གྱིས། དགྲ་བཅོམ་པ་རྫུ་འཕྲུལ་ཅན་དེ་དག་རེ་རེ་སྤྲུལ་པ་བྱེད་པའི་སྤྲུལ་པ་དེ་དག་རེ་རེས་ཀྱང་དེ་བཞིན་དུ་སྤྲུལ་པ་མངོན་པར་སྤྲུལ་ན།
en: Then, imagine if each of these worthy ones with miraculous abilities were to further project an identical set of emanations from each of the already emanated displays.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་དག་བགྲང་བ་ལ་འཇུག་པར་ནུས་སམ།
en: Now tell me, Śāradvatīputra, would anyone be able to count that number of emanations?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Śāradvatīputra replied, “No, Blessed One, certainly not!”

source: སེམས་ཅན་དེ་དག་གིས་ཕྱིར་མི་ལྡོག་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་གང་ན་གནས་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བསྲེག་པར་མངོན་པར་སྤྲུལ་པ་བྱེད་ན།
en: The Blessed One said, “Śāradvatīputra, imagine if all those beings were to miraculously manifest a conflagration to consume the trichiliocosm wherever a nonregressing son or daughter of noble family lived.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་སེམས་ཅན་དེ་དག་རྫུ་འཕྲུལ་ཆེན་པོ་རྣམ་པར་སྟོན་པ་ཡིན་ནམ། གསོལ་པ།
en: Tell me, Śāradvatīputra, would that be a great miraculous manifestation on the part of those beings?”

source: བཅོམ་ལྡན་འདས་དེ་དག་ནི་རྫུ་འཕྲུལ་ཆེ་བ་ལགས་སོ།
en: Śāradvatīputra replied, “Blessed One, that would be a great manifestation!

source: །རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་ཞིང་། འཇིགས་པ་ཆེན་པོའི་ཚུལ་གྱིས་ཉེ་བར་གནས་པ་ལགས་སོ།
en: It would be a great manifestation—and also a terrifying one!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་གནས་ལ། དེ་ལྟར་འཇིགས་པ་དྲག་པོ་ཀུན་ནས་སྟོན་ཀྱང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་སེམས་ཟད་པར་བྱ་བའམ། ཟིལ་གྱིས་མནན་པའམ། བཟློག་ནུས་པའི་སྐལ་བ་མེད་དོ།
en: The Blessed One said, “Śāradvatīputra, even if those countless and limitless worlds were to remain ablaze for as many eons as there are grains of sand in the Ganges, that intensely terrifying display would not be able to discourage, overwhelm, or shake the mind of those nonregressing bodhisattva great beings.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་དཔག་ཏུ་མེད་པ་དེ་དག་དང་། བདུད་སྡིག་ཅན་དེ་དག་གི་རྫུ་འཕྲུལ་གང་ཡིན་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་གང་ཡིན་པ་འདི་གཉིས་ལ། གང་ཆེས་མཐུ་དང་ལྡན་པ་ཡིན།
en: Śāradvatīputra, tell me, if you compare the miraculous manifestations of those limitless beings and demons to the miraculous ability of a nonregressing bodhisattva, which of them is the greatest and most powerful?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་རྫུ་འཕྲུལ་དང་ལྡན་པ་འདི་དག་གི་ནང་ན། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྫུ་འཕྲུལ་དང་། སེམས་འདི་ནི་ཆེས་མཐུ་དང་ལྡན་པ་ལགས་སོ། །
en: Śāradvatīputra replied, “Blessed One, between these two types of miraculous ability, the miracles and the mind of a nonregressing bodhisattva are greater and more powerful.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་དང་། སྟོབས་དང་ལྡན་པ་གང་ཡིན་པ་དེ་མཆོག་བྱེད་པའམ། མཆོག་ཏུ་འབྱུང་བར་འོས་པ་ཡིན་ནམ།
en: The Blessed One said, “Śāradvatīputra, tell me then, should those who possess this type of miraculous ability and strength be considered supreme and perfect?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན། རྣམ་གྲངས་འདིས་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའི་སེམས་མཆོག་ཅེས་བགྱི་བ་ནས་གོང་ན་མ་མཆིས་པ་ཞེས་བགྱི་བའི་བར་དུ་སྟེ།
en: Śāradvatīputra replied, “As far as I understand the meaning expounded by the Blessed One, according to this teaching, except for the mind of omniscience, the mind of a bodhisattva is supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ནི་ཟད་པར་བགྱིར་རྔོ་མི་ཐོགས་པའི་སླད་དུ་ལགས་སོ།
en: Because the mind of a nonregressing bodhisattva is impossible to resist.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ།
en: Then the Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, that is correct.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ནི་ཟད་པར་བྱར་མི་ནུས་སོ།
en: The mind of a nonregressing bodhisattva cannot possibly be resisted.”

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ཕྱིར་མི་ལྡོག་པའི་སའི་ལེའུ་སྟེ་བདུན་པའོ།། །།
en: This concludes the seventh chapter from “The Perfection of Generosity” entitled “The Level of Nonregression.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་གང་གིས་ན། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཟད་པར་བྱར་མི་ནུས།
en: Venerable Pūrṇa Maitrāyaṇīputra asked Venerable Śāradvatīputra, “Venerable Śāradvatīputra, which teaching makes it impossible for the minds of nonregressing bodhisattva great beings to become exhausted?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་གང་གི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་གང་དང་གང་སྦྱིན་པ་ན་དེ་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་ནས་སྦྱིན་པར་བྱེད་དེ།
en: Śāradvatīputra replied, “Venerable Pūrṇa, whenever bodhisattva great beings practice generosity, they always do so with a focus on the state of omniscience.

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཟད་པར་བྱ་བའམ། ཟིལ་གྱིས་མནན་པར་མི་ནུས་སོ།
en: Therefore, the bodhisattva great beings’ minds cannot be exhausted or surpassed.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། སྐྱེས་བུ་ཚོང་པ་ཞིག་ཟོང་འབུམ་ཕྲག་མང་པོ་སྤྱོད་ཅིང་།
en: Venerable Pūrṇa, imagine a merchant who is doing business involving many hundreds of thousands of goods.

source: དེ་ཚོང་བྱེད་ལ། ཚོང་པ་དེས་ཚོང་དཔོན་ནམ། དེད་དཔོན་གང་ཡང་རུང་བ་ལས་ལོ་འབུམ་ཕྲག་མང་པོ་ཞིག་ནས་སྐྱིན་པོ་བླངས་པ་ལས།
en: To conduct his business he has, for many hundreds of thousands of years, taken loans from wealthy merchants or traders.

source: དེའི་ཚོང་མ་རུང་བར་གྱུར་ནས། དེས་རྒྱལ་པོ་ལ་བསྐོར་ཏེ་རྒྱལ་པོའི་གན་དུ་སོང་ངོ་།
en: If his business were to turn out unsuccessfully, he could approach the royal quarters and petition the king.

source: །དེ་རྒྱལ་པོའི་དཔུང་དེས་ན་རྒྱལ་པོས་ཡོངས་སུ་བཟུང་བའི་མི་དེ་ལ་ཚོང་དཔོན་དེ་དང་། དེད་དཔོན་དེས་ཚུགས་པར་མི་འགྱུར་རོ།
en: If he in this way were to receive the protection of the royal troops, none of the merchants or traders would be able to cause him any harm.

source: དེ་ལྟར་དེ་དཔུང་དང་ལྡན་པའི་ཕྱོགས་འདི་ལྟ་སྟེ། རྒྱལ་པོའི་ཕྱོགས་དཔུང་དང་ལྡན་པའི་ཕྱོགས་དེ་ལ་རྟེན་པའི་ཕྱིར་རོ།
en: Because he would be supported by the group that controls the army; he would rely on the faction that enjoyed the royal army’s support. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་དང་པོ་སེམས་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་དང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ནི་དཔུང་དང་ལྡན་པའི་ཕྱོགས་ལ་རྟེན་ཏོ།
en: Venerable Pūrṇa, in the same way, the minds of bodhisattva great beings—whether they are those who have just aroused the mind of awakening for the first time or are nonregressing bodhisattvas—also rely on the faction that controls the army.

source: འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་དཔུང་དང་ལྡན་པའི་ཕྱོགས་དེ་ལ་རྟེན་པས་ན།
en: Because they rely on the faction that controls the army of omniscience.

source: དེ་ཉན་ཐོས་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མནན་པར་མི་ནུས་སོ། །
en: In that way, none of the hearers are able to overpower them.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། སྐྱེས་བུ་རྒྱལ་པོ་ལ་རྟེན་པ་ནི་ལོངས་སྤྱོད་ཟད་པར་གྱུར་ཀྱང་། འོན་ཀྱང་ཚུགས་པར་མི་ནུས་པ་དེ་བཞིན་དུ།
en: Venerable Pūrṇa, even if the wealth of the man who relied on the king were to be depleted, no one would be able to harm him.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་ལ་རྟེན་པ་ཡང་། འདི་ལྟར་ཉན་ཐོས་ཐམས་ཅད་དང་། བདུད་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ། །སྨྲས་པ།
en: In the same way, when bodhisattva great beings rely on the side of omniscience, no hearer or demon is able to harm them.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཐམས་ཅད་ཀྱིས་ཚུགས་པར་འགྱུར།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, how can bodhisattvas be harmed by the hearers?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་གལ་ཏེ་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱིས་སྒྲོགས་ཤིང་འཆད་པ་ན། དེའི་སེམས་སྐྱེད་ཅིང་བདག་ཀྱང་དེ་ལྟར་གྱུར་ཅིག་ཅེས་སེམས་སྐྱེད་ན། ཉན་ཐོས་རྣམས་ཀྱིས་ཚུགས་པ་ཡིན་ནོ།
en: Śāradvatīputra replied, “Venerable Pūrṇa, they can be harmed by the hearers if they hear explanations of the levels of the hearers and solitary buddhas and think, ‘May I develop their attitude and become like them!’

source: །གང་དེའི་གཏམ་གྱི་རོ་མྱོང་བར་བྱེད་པ་དང་། དེ་ལ་ཡང་དགའ་བར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་བསྐྱེད་པ་དེས་ན་ཚུགས་པར་འགྱུར་རོ།
en: Any bodhisattva who relishes such discourse and delights in it will be harmed by cultivating such inappropriate thoughts.

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཅིའི་ཕྱིར་ན། དེ་དག་ལ་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ཞེས་བྱ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, why are these called ‘inappropriate thoughts’?”

source: སྨྲས་པ། འདི་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གེགས་བྱེད་པ་ཡིན་ཏེ། འདི་དག་སྐྱེད་པར་བྱེད་པ་མ་ཡིན་ལ། འདི་དག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རིང་བར་བྱེད་པ་ཡིན་ཏེ།
en: Śāradvatīputra replied, “Because they serve to impede the omniscience of bodhisattva great beings, they do not serve to develop it, and they make this omniscience take a long time.

source: དེ་བས་ན་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ཞེས་བྱའོ།
en: Therefore, they are called the inappropriate thoughts of bodhisattva great beings.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། རྣལ་འབྱོར་པ་རྣལ་འབྱོར་སྤྱོད་པ་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱ་བར་འདོད་ཅིང་། ཡང་དག་པ་ལ་ངེས་པར་འཇུག་པར་འདོད་པའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཀུན་ཏུ་འབྱུང་བ་ནི་དགྲ་བཅོམ་པ་ཉིད་རིང་བར་བྱེད་པ་ཡིན་ཏེ།
en: Venerable Pūrṇa, if a practitioner wishes to actualize the limit of reality by means of spiritual practice and wishes to enter into the ascertainment of the real, any occurrences of desire, anger, or delusion will postpone his attainment of the state of a worthy one.
